{
	"posts":[
		{
		"t":"03/17/2015",
		"h":"post one",
		"c":"this is the content of post one."
		},
		{
		"t":"03/18/2015",
		"h":"post two",
		"c":"this is the content of post two."
		},
		{
		"t":"03/18/2015",
		"h":"post three",
		"c":"this is the content of post two."
		},
		{
		"t":"03/18/2015",
		"h":"post four",
		"c":"this is the content of post two."
		},
		{
		"t":"03/18/2015",
		"h":"post five",
		"c":"this is the content of post two."
		},
		{
		"t":"03/18/2015",
		"h":"post six",
		"c":"this is the content of post two."
		},
		{
		"t":"03/18/2015",
		"h":"post seven",
		"c":"this is the content of post two."
		},
		{
		"t":"03/18/2015",
		"h":"post eight",
		"c":"this is the content of post two."
		},
		{
		"t":"03/18/2015",
		"h":"post seven",
		"c":"this is the content of post two."
		},
		{
		"t":"11/29/2015",
		"h":"What I'm thankful for",
		"c":"Each year of my adult life I am faced with new challenges and opportunities. 2015 was full of both of these. I graduated from MATC at the end of 2014. At this point I was faced with the challenge of what to do next. This first thing I had to overcome was unemployment. I had quit my job at PF Changs to concentrate on my final semester and did not want to go back. I spend everyday applying for graphic design jobs and continuing to build my portfolio. After what seemed like an eternity I was offered a intern position at a company in Burlington. While at times it was tedious and boring I’m thankful for everything I learned and the opportunity to work in an office environment. When my internship ended I was lucky enough to get a job at Lakefront Brewery. The plan was to work there until I figured out my next move. I’m thankful for all the friends I’ve made while working there and for the flexibility they’ve allowed while I took the next step in life. Which brings me to the latest challenge in my life. DevCode Camp has been a rewarding experience thus far. I’m thankful for the support of my friends and family over the past few months. It has been simultaneously the most challenging yet rewarding experience of my life."
		},
		{
		"t":"11/29/2015",
		"h":"SVG is neat",
		"c":"I’ve learned quite a few things at DevCode Camp over the past few months. One thing that really interests me is SVG. It amazes me that we aren’t seeing this everywhere. With so many different screen sizes, to me, it just makes sense to have something that can scale to any size and maintain the quality of the original image. I could see this being especially beneficial if you had complex content on a web page where the user could zoom in to see finer details. I can’t wait until I have some free time to dive a little deeper into SVG."
		},
		{
		"t":"04/18/2016",
		"h":"Closure in JavaScript takeaways",
		"c":"While learning JavaScript one thing that has taken me a while to digest is closures. Scope in JavaScript seems much more loose than other languages I’ve worked with so far. The idea that a function can grab variables values from outside the function was alien and scary to me at first. But, the more I looked into it the more I realized just how useful this kind of flexibility could be."
		},
		{
		"t":"04/18/2016",
		"h":"Objects in JavaScript",
		"c":"While objects in Javascript are still relatively new to me I’ve formed a few opinions about OOP in JS. The concept of cloning objects seems straight forward at first because JavaScript is such a object driven language. One thing that has been troubling me is settling into my own habits for solving problems with OOP. Because JS is so new to me I absorb the opinions of the tutorials I do and the articles I read. This is where the flexibility of JS has caused me issues in the short-term. Part of me wishes there would be simple problem A is best solved with answer B etc. It feels like having so many ways to tackle a problem while using objects is inhibiting me. I know one day I’ll realize the awesome power that is prototypal inheritance but for the moment It feels unpredictable."
		}
	]
}

